Hey @fmunozmiranda with 0.6.20-beta Endpoint Identity Group is being created with parent_id, but state is not handled properly. 

First terraform apply command works as expected:

```
terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ciscoise_endpoint_group.example will be created
  + resource "ciscoise_endpoint_group" "example" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + description    = "string"
          + id             = (known after apply)
          + link           = (known after apply)
          + name           = "Test07"
          + parent_id      = "3b76f840-8c00-11e6-996c-525400b48521"
          + system_defined = "false"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ciscoise_endpoint_group.example: Creating...
ciscoise_endpoint_group.example: Creation complete after 1s [id=id:=7076dda0-0ee2-11ee-a056-4248683d5372\name:=Test07]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

but everytime I re-run terraform plan without any modifications to terraform code im getting:

```
terraform plan
ciscoise_endpoint_group.example: Refreshing state... [id=id:=7076dda0-0ee2-11ee-a056-4248683d5372\name:=Test07]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # ciscoise_endpoint_group.example will be updated in-place
  ~ resource "ciscoise_endpoint_group" "example" {
        id   = "id:=7076dda0-0ee2-11ee-a056-4248683d5372\\name:=Test07"
        # (1 unchanged attribute hidden)

      ~ parameters {
            id             = "7076dda0-0ee2-11ee-a056-4248683d5372"
            name           = "Test07"
          + parent_id      = "3b76f840-8c00-11e6-996c-525400b48521"
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

which is not correct behaviour. I should not see any updates in terraform plan command, after i create resource.